# Lab | Data Aggregation and Filtering

In this challenge, we will continue to work with customer data from an insurance company. We will use the dataset called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by first performing data cleaning, formatting, and structuring.

In [1]:
import pandas as pd 
import numpy as np

In [2]:
url='https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis.csv'
    
df=pd.read_csv(url)

In [3]:
df.columns

df.columns=pd.Series(df.columns).apply(lambda col: col.lower()) #lowered
df.columns=pd.Series(df.columns).apply(lambda x: x.replace(' ','_')) #replace
df.columns

Index(['unnamed:_0', 'customer', 'state', 'customer_lifetime_value',
       'response', 'coverage', 'education', 'effective_to_date',
       'employmentstatus', 'gender', 'income', 'location_code',
       'marital_status', 'monthly_premium_auto', 'months_since_last_claim',
       'months_since_policy_inception', 'number_of_open_complaints',
       'number_of_policies', 'policy_type', 'policy', 'renew_offer_type',
       'sales_channel', 'total_claim_amount', 'vehicle_class', 'vehicle_size',
       'vehicle_type'],
      dtype='object')

In [4]:
df

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_open_complaints,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2/18/11,Employed,M,...,0.0,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,NaN
1,1,KX64629,California,2228.525238,No,Basic,College,1/18/11,Unemployed,F,...,0.0,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,NaN
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2/10/11,Employed,M,...,0.0,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,1/11/11,Employed,M,...,0.0,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,1/17/11,Medical Leave,F,...,NaN,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
10905,10905,FE99816,Nevada,15563.369440,No,Premium,Bachelor,1/19/11,Unemployed,F,...,NaN,7,Personal Auto,Personal L1,Offer3,Web,1214.400000,Luxury Car,Medsize,A
10906,10906,KX53892,Oregon,5259.444853,No,Basic,College,1/6/11,Employed,F,...,0.0,6,Personal Auto,Personal L3,Offer2,Branch,273.018929,Four-Door Car,Medsize,A
10907,10907,TL39050,Arizona,23893.304100,No,Extended,Bachelor,2/6/11,Employed,F,...,0.0,2,Corporate Auto,Corporate L3,Offer1,Web,381.306996,Luxury SUV,Medsize,NaN
10908,10908,WA60547,California,11971.977650,No,Premium,College,2/13/11,Employed,F,...,4.0,6,Personal Auto,Personal L1,Offer1,Branch,618.288849,SUV,Medsize,A
10909,10909,IV32877,NaN,6857.519928,NaN,Basic,Bachelor,1/8/11,Unemployed,M,...,0.0,3,Personal Auto,Personal L1,Offer4,Web,1021.719397,SUV,Medsize,NaN

1. Create a new DataFrame that only includes customers who have a total_claim_amount greater than $1,000 and have a response of "Yes" to the last marketing campaign.

In [54]:
both= (df['total_claim_amount'] > 1000) & (df['response'] == 'Yes' )
filtered= df[both]

df_claims = pd.DataFrame({
    'Customer': df['customer'],
    'total_claim_amount': filtered['total_claim_amount'],
    'response': filtered['response'],
    })

In [5]:
both_conditions = (df['total_claim_amount'] > 1000) & (df['response'] == 'Yes')
df_claims = df[both_conditions][['customer', 'total_claim_amount', 'response']]

In [6]:
df_claims

      customer  total_claim_amount response
189    OK31456         1358.400000      Yes
236    YJ16163         1358.400000      Yes
419    GW43195         1027.200000      Yes
442    IP94270         1261.319869      Yes
587    FJ28407         1027.000029      Yes
...        ...                 ...      ...
10351  FN44127         1176.278800      Yes
10373  XZ64172         1324.800000      Yes
10487  IX60941         1176.278800      Yes
10565  QO62792         1008.000000      Yes
10708  CK39096         1027.000029      Yes

[67 rows x 3 columns]

**2. Using the original Dataframe, analyze the average total_claim_amount by each policy type and gender for customers who have responded "Yes" to the last marketing campaign. Write your conclusions.**

In [7]:
conditions = (df['response'] == 'Yes')
filtered= df[conditions]

df_totals = pd.DataFrame({
    'gender': df['gender'],
    'total_claim_amount': df['total_claim_amount'],
    'response': filtered['response'],
    })

pivot_df = df.pivot_table(index='gender', columns='policy_type', values=['total_claim_amount'], aggfunc='mean')

pivot_df

            total_claim_amount
policy_type     Corporate Auto Personal Auto Special Auto
gender
F                   397.799287    413.239658   458.139623
M                   462.223565    459.919476   420.355202

In [64]:
df_totals = pd.DataFrame({
    'gender': df['gender'],
    'total_claim_amount': df['total_claim_amount'],
    'response': filtered['response'],
    })

df_totals

      gender  total_claim_amount response
0          M          292.800000      NaN
1          F          744.924331      NaN
2          M          480.000000      NaN
3          M          484.013411      Yes
4          F          707.925645      NaN
...      ...                 ...      ...
10905      F         1214.400000      NaN
10906      F          273.018929      NaN
10907      F          381.306996      NaN
10908      F          618.288849      NaN
10909      M         1021.719397      NaN

[10910 rows x 3 columns]

3. Analyze the total number of customers who have policies in each state, and then filter the results to only include states where there are more than 500 customers.

In [8]:
pivot_df5 = df.pivot_table(index='state', columns='policy_type', values='number_of_policies', aggfunc= 'sum')

pivot_df5

policy_type  Corporate Auto  Personal Auto  Special Auto
state
Arizona                1192           4471           253
California             2543           7705           354
Nevada                  591           2084            96
Oregon                 1859           6429           378
Washington              541           1967            75

California by far has the most customers while Washington has the least

In [9]:
pivot_df5['Totals']=pivot_df5['Corporate Auto']+pivot_df5['Personal Auto']+pivot_df5['Special Auto']
pivot_df5['Totals']

filtered_states= (pivot_df5['Totals'] > 500)
pivot_df5[filtered_states]

policy_type  Corporate Auto  Personal Auto  Special Auto  Totals
state
Arizona                1192           4471           253    5916
California             2543           7705           354   10602
Nevada                  591           2084            96    2771
Oregon                 1859           6429           378    8666
Washington              541           1967            75    2583

4. Find the maximum, minimum, and median customer lifetime value by education level and gender. Write your conclusions.

In [10]:
pivot_df2 = df.pivot_table(index='gender', columns='education', values='customer_lifetime_value', aggfunc={'customer_lifetime_value':['median','max','min']})

pivot_df2

                   max                                                 \
education     Bachelor      College       Doctor High School or Below
gender
F          73225.95652  61850.18803  44856.11397          55277.44589
M          67907.27050  61134.68307  32677.34284          83325.38119

                             median                            \
education       Master     Bachelor      College       Doctor
gender
F          51016.06704  5640.505303  5623.611187  5332.462694
M          50568.25912  5548.031892  6005.847375  5577.669457

                                                     min               \
education High School or Below       Master     Bachelor      College
gender
F                  6039.553187  5729.855012  1904.000852  1898.683686
M                  6286.731006  5579.099207  1898.007675  1918.119700


education       Doctor High School or Below       Master
gender
F          2395.570000          2144.921535  2417.777032
M          2267.604038          1940.981221  2272.307310

conclusion: F with bachelor and M with High School or Below had the highest, for F and M high school or below had the highest median, and F and M with Bachelor had the lowest

## Bonus

5. The marketing team wants to analyze the number of policies sold by state and month. Present the data in a table where the months are arranged as columns and the states are arranged as rows.

6.  Display a new DataFrame that contains the number of policies sold by month, by state, for the top 3 states with the highest number of policies sold.

*Hint:*
- *To accomplish this, you will first need to group the data by state and month, then count the number of policies sold for each group. Afterwards, you will need to sort the data by the count of policies sold in descending order.*
- *Next, you will select the top 3 states with the highest number of policies sold.*
- *Finally, you will create a new DataFrame that contains the number of policies sold by month for each of the top 3 states.*

7. The marketing team wants to analyze the effect of different marketing channels on the customer response rate.

Hint: You can use melt to unpivot the data and create a table that shows the customer response rate (those who responded "Yes") by marketing channel.

External Resources for Data Filtering: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [ ]:
# your code goes here